#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/team-blackcat/e-com-blackcat/runs/run-1D7ePyj6rFxhaB9G

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
data.google_secret_manager_secret.database: Reading...
data.google_secret_manager_secret.password: Reading...
data.google_secret_manager_secret.user: Reading...
data.google_secret_manager_secret.host: Reading...
data.google_secret_manager_secret.host: Read complete after 1s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-address]
data.google_secret_manager_secret.database: Read complete after 1s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-database-blackcat]
data.google_secret_manager_secret.user: Read complete after 1s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-user-blackcat]
data.google_secret_manager_secret.password: Read complete after 1s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-password-blackcat]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/ceri-m1-ecommerce-2022/services/cloud-run-backend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_service.backend has changed
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/ceri-m1-ecommerce-2022/services/cloud-run-backend"
        name                       = "cloud-run-backend"
      + status                     = [
          + {
              + conditions                   = [
                  + {
                      + message = <<-EOT
                            Revision 'cloud-run-backend-rwqd7' is not ready and cannot serve traffic. spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-address/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[1].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-password-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[2].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-database-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                        EOT
                      + reason  = "SecretsAccessCheckFailed"
                      + status  = "False"
                      + type    = "Ready"
                    },
                  + {
                      + message = <<-EOT
                            spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-address/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[1].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-password-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[2].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-database-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                        EOT
                      + reason  = "SecretsAccessCheckFailed"
                      + status  = "False"
                      + type    = "ConfigurationsReady"
                    },
                  + {
                      + message = <<-EOT
                            Revision 'cloud-run-backend-rwqd7' is not ready and cannot serve traffic. spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-address/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[1].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-password-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[2].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-database-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                        EOT
                      + reason  = "SecretsAccessCheckFailed"
                      + status  = "False"
                      + type    = "RoutesReady"
                    },
                ]
              + latest_created_revision_name = "cloud-run-backend-rwqd7"
              + latest_ready_revision_name   = ""
              + observed_generation          = 1
              + url                          = ""
            },
        ]
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.backend is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "backend" {
      ~ id                         = "locations/europe-west1/namespaces/ceri-m1-ecommerce-2022/services/cloud-run-backend" -> (known after apply)
      ~ name                       = "cloud-run-backend" -> "blackcat-backend"
      ~ project                    = "ceri-m1-ecommerce-2022" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = <<-EOT
                            Revision 'cloud-run-backend-rwqd7' is not ready and cannot serve traffic. spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-address/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[1].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-password-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[2].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-database-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                        EOT
                      - reason  = "SecretsAccessCheckFailed"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = <<-EOT
                            spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-address/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[1].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-password-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[2].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-database-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                        EOT
                      - reason  = "SecretsAccessCheckFailed"
                      - status  = "False"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = <<-EOT
                            Revision 'cloud-run-backend-rwqd7' is not ready and cannot serve traffic. spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-address/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[1].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-password-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                            spec.template.spec.containers[0].env[2].value_from.secret_key_ref.name: Permission denied on secret: projects/351985998296/secrets/mysql-database-blackcat/versions/latest for Revision service account 351985998296-compute@developer.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                        EOT
                      - reason  = "SecretsAccessCheckFailed"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "cloud-run-backend-rwqd7"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "serving.knative.dev/creator"       = "terraform-blackcat@ceri-m1-ecommerce-2022.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "terraform-blackcat@ceri-m1-ecommerce-2022.iam.gserviceaccount.com"
            } -> (known after apply)
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
            } -> (known after apply)
          ~ namespace        = "ceri-m1-ecommerce-2022" -> (known after apply)
          ~ resource_version = "AAXxXWxLgT4" -> (known after apply)
          ~ self_link        = "/apis/serving.knative.dev/v1/namespaces/351985998296/services/cloud-run-backend" -> (known after apply)
          ~ uid              = "957c8a58-280d-4a35-b860-7e758ce21a02" -> (known after apply)
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  - "autoscaling.knative.dev/maxScale" = "5"
                } -> (known after apply)
              ~ generation       = 0 -> (known after apply)
              ~ labels           = {} -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              ~ service_account_name  = "351985998296-compute@developer.gserviceaccount.com" -> "terraform-blackcat@ceri-m1-ecommerce-2022.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                    # (1 unchanged attribute hidden)

                  ~ ports {
                      ~ container_port = 8080 -> (known after apply)
                      ~ name           = "http1" -> (known after apply)
                      + protocol       = (known after apply)
                    }

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> (known after apply)
                      ~ requests = {} -> (known after apply)
                    }

                    # (4 unchanged blocks hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + api_url = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "TF_VAR_GOOGLE_APPLICATION_CREDENTIALS" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1D7ePyj6rFxhaB9G/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pushed by: @iammouadagr, Action: `pull_request`*